https://github.com/okovtun/SBD_211.git
https://www.youtube.com/watch?v=jy029M3X3a4&list=PLeqyOOqxeiIP1btvvWl1ww22b6gvA2miK

TOREAD:
https://cplusplus.com/doc/tutorial/constants/

TODO:
1. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/Geometria1.txt
2. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/ChessBoard.jpg
3. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/HardChess.jpg

DONE:
0. Написать программу Shooter, которая по нажатой клавише определяет действие ползователя:
	w - вперед
	s - назад
	a - влево
	d - вправо
	space - прыжок
	enter - огонь
	esc - выход
	Если пользователь нажал на какую-либо другую клавишу, программа выводит "Error".
1. Написать программу, в которую ползователь вводит число, а программа вычисляет Факториал введенного числа;
   Факториал - это произведение ряда чисел от 1 до указанного, например:
	5! = 1*2*3*4*5 = 120;
2. Возвести указанное число в указанную степень, основание и показатель степени вводятся с клавиатуры;
3. Вывести на экран таблицу ASCII-символов по 16 символов в строке;
4. Вывести на экран ряд Фибоначчи до числа, введенного с клавиатуры.
   Ряд Фибоначчи можно построить из двух чисел 0 и 1, третье число из ряда является суммой первых двух.
   Каждый следующий член ряда - это сумма двух предыдущих членов:
	0	1	1	2	3	5	8	13	21 .......
5. Вывести на экран заданное количество чисел из ряда Фибоначчи;
6. Вывести на экран ряд простых чисел, до указанного предела.
   Простым называется число, которое делится только на себя и на единицу;

DONE:
1. Написать программу "Калькулятор", которая принимает выражение вида 2 + 3,
   и возвращает результат следующим образом:
	2 + 3 = 5;
2. Пользователь вводит с клавиатуры число, и программа говорит, является ли 
   введенное число палиндромом. Палиндром - это число, которое читается одинаково,
   как слева направо, так и справа налево;
3. Пользователь вводит номер автобусного билета, и программа говорит, 
   это счастливый билет или обычный билет.
   Номер билета - это шестизначное число. 
   Счастливым является билет, у которого сумма трех старших разрядов == сумме трех младших разрядов.
   123123 - счастливый билет
   123456 - обычный билет
   124502 - счастливый билет

DONE:
Следующие задачи необходимо решить без использования компилятора,
а в Visual Studio лишь проверть полученный результат:
1.	int i = 3;
	i = i++ + ++i;
	cout << i << endl;	//Что будет выведено на экран

2.	int i = 3;
	i = ++i + ++i;
	cout << i << endl;	//Что будет выведено на экран

3.	int i = 3;
	i = i++ + 1 + ++i*2;
	cout << i << endl;	//Что будет выведено на экран

4.	int i = 3;
	i = i++ + 1 + ++i *= 2;
	cout << i << endl;	//Что будет выведено на экран

5.	int i = 3;
	i += i++ + 1 + ++i *= 2;
	cout << i << endl;	//Что будет выведено на экран

6.	int i = 3;
	i *= i++ + 1 + ++i += 2;
	cout << i << endl;	//Что будет выведено на экран



TOREAD:
http://www.softelectro.ru/ieee754.html

TODO:
1. Выучить теорию!
2. Решить все задачи из файла:https://github.com/okovtun/SBD_211/blob/master/DataTypes/VariablesTask.pdf;

DONE:
1. Выучить теорию!
2. Используя Escape-последовательности вывести в консоль стишок
   "В лесу родилась Ёлочка". Стишок должен быть выровнен не середине окна консоли,
   и его куплеты должны быть разделены пустой строкой;
