https://github.com/okovtun/SBD_211.git
https://www.youtube.com/watch?v=jy029M3X3a4&list=PLeqyOOqxeiIP1btvvWl1ww22b6gvA2miK

TOREAD:
https://cplusplus.com/doc/tutorial/constants/

TODO:
1. Написать программу "Калькулятор", которая принимает выражение вида 2 + 3,
   и возвращает результат следующим образом:
	2 + 3 = 5;
2. Пользователь вводит с клавиатуры число, и программа говорит, является ли 
   введенное число палиндромом. Палиндром - это число, которое читается одинаково,
   как слева направо, так и справа налево;
3. Пользователь вводит номер автобусного билета, и программа говорит, 
   это счастливый билет или обычный билет.
   Номер билета - это шестизначное число. 
   Счастливым является билет, у которого сумма трех старших разрядов == сумме трех младших разрядов.
   123123 - счастливый билет
   123456 - обычный билет
   124502 - счастливый билет

DONE:
Следующие задачи необходимо решить без использования компилятора,
а в Visual Studio лишь проверть полученный результат:
1.	int i = 3;
	i = i++ + ++i;
	cout << i << endl;	//Что будет выведено на экран

2.	int i = 3;
	i = ++i + ++i;
	cout << i << endl;	//Что будет выведено на экран

3.	int i = 3;
	i = i++ + 1 + ++i*2;
	cout << i << endl;	//Что будет выведено на экран

4.	int i = 3;
	i = i++ + 1 + ++i *= 2;
	cout << i << endl;	//Что будет выведено на экран

5.	int i = 3;
	i += i++ + 1 + ++i *= 2;
	cout << i << endl;	//Что будет выведено на экран

6.	int i = 3;
	i *= i++ + 1 + ++i += 2;
	cout << i << endl;	//Что будет выведено на экран



TOREAD:
http://www.softelectro.ru/ieee754.html

TODO:
1. Выучить теорию!
2. Решить все задачи из файла:https://github.com/okovtun/SBD_211/blob/master/DataTypes/VariablesTask.pdf;

DONE:
1. Выучить теорию!
2. Используя Escape-последовательности вывести в консоль стишок
   "В лесу родилась Ёлочка". Стишок должен быть выровнен не середине окна консоли,
   и его куплеты должны быть разделены пустой строкой;
